# 1:Create a dataframe with 4 columns 4 rows

In [103]:

import pandas as pd
a=([[1,2,3,4],[4,5,6,7],[8,9,10,11],[12,13,14,15]])
a1=pd.DataFrame(a,index=["a","b","c","d"],columns=["e","f","g","h"])
print(a1)

    e   f   g   h
a   1   2   3   4
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

# 2:print all Columns form your data frame

In [104]:
a1.columns

Index(['e', 'f', 'g', 'h'], dtype='object')

# 3:print all rows from your data frame

In [105]:
a1.loc[:]

    e   f   g   h
a   1   2   3   4
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

# 4  print Second  column in your data frame

In [106]:
a1.loc[:,["f"]]

    f
a   2
b   5
c   9
d  13

# 5:print last 2 columns from your data Frame

In [107]:
a1.loc[:,"g":]

    g   h
a   3   4
b   6   7
c  10  11
d  14  15

# 6:print  fourth row from your data Frame

In [108]:
a1.loc[["d"]]

    e   f   g   h
d  12  13  14  15

# 7:print first 2  Rows from your data Frame

In [109]:
a1.loc[:"b"]

   e  f  g  h
a  1  2  3  4
b  4  5  6  7

# 8:print all rows and first 2 columns from your data Frame

In [110]:
a1.loc[:,:"f"]

    e   f
a   1   2
b   4   5
c   8   9
d  12  13

# 9:Delete any row from your data Frame

In [111]:
a1.drop("a")

    e   f   g   h
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

# 10:Delete any column from your data Frame

In [112]:
a1.pop("e")

a     1
b     4
c     8
d    12
Name: e, dtype: int64

# 11:Add a column to a Data Frame

In [113]:
w=[0,9,8,7]
a1['s']=w
print(pd.DataFrame(a1))

    f   g   h  s
a   2   3   4  0
b   5   6   7  9
c   9  10  11  8
d  13  14  15  7

# 12:Add a Row to Data Frame

In [114]:
w={'f':0,'g':0,'h':0,'s':0}
a=pd.DataFrame(w,index=["i"])
a1=pd.concat([a,a1])
a1

    f   g   h  s
i   0   0   0  0
a   2   3   4  0
b   5   6   7  9
c   9  10  11  8
d  13  14  15  7

# 13:Iterate all Columns  in your Data Frame and print result

In [71]:
for i in a1:
    print(i)

e
f
g
h
s

# 14:Iterate the 3rd column values  of your Data frame and print result.

In [72]:
l=a1.pop("f")
for i in l:
    print(i)

0
2
5
9
13

# 15:Iterate all Rows  in your Data Frame and print result.

In [73]:
for i in a1.iterrows():
    print(i)

(13, e    0.0
g    0.0
h    NaN
s    0.0
Name: 13, dtype: float64)
('a', e    NaN
g    3.0
h    4.0
s    0.0
Name: a, dtype: float64)
('b', e    NaN
g    6.0
h    7.0
s    9.0
Name: b, dtype: float64)
('c', e     NaN
g    10.0
h    11.0
s     8.0
Name: c, dtype: float64)
('d', e     NaN
g    14.0
h    15.0
s     7.0
Name: d, dtype: float64)

# 16:Read income.csv  file and print as Data Frame

In [74]:
a="income_csv"
f=pd.read_csv(a)
f

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

# 17:Get 2006 column  info from your data Frame by using drop

In [75]:
f.drop(columns=["2006"],axis=1)

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528